Repository: mohamed-mashaly1403/school
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Country you live in
ar: الدولة التى تدرس وتعيش فيها(مطلوب)

source: City you live in
ar: المدينة التى تدرس وتعيش فيها(إختياري)

source: 1st Academic degree(required)
ar: الدرجة العلمية -(مطلوب)

source: 2nd Academic degree(optional)
ar: درجة علمية إضافية-(إختياري)

source: 3rd Academic degree(optional)
ar: درجة علمية إضافية-(إختياري)

source: 4th Academic degree(optional)
ar: درجة علمية إضافية-(إختياري)

source: 1st subject you teach(required)
ar: المادة التي تدرسها(مطلوب)

source: 2nd subject you teach(optional)
ar: مادة أخرى تدرسها -(إختياري)

source: 3rd subject you teach(optional)
ar: مادة أخرى تدرسها -(إختياري)

source: Grades you teach.
ar: الصفوف التي تدرسها

source: Bank IBAN
ar: رقم الايبان

source: Bank Name
ar: اسم البنك

source: Bank Country
ar: دولة البنك

source: Recap your Experience
ar: ملخص الخبرات

source: Any thing you want to say about yourself
ar: اي ملاحظات تود أن تخبرنا بها

source: Filetype not supported.
ar: نوع الملف غير مدعوم

source: Money will be added to your Bank account soon
ar: سيتم اضافة المبلغ لحسابك قريبا

source: Your bank account details missing!
ar: بيانات حسابك البنكي غير مكتملة

source: Your Account will be reviewed and will back to you soon
ar: سيتم مراجعة حسابك قريبا

source: file bigger than 2 MB
ar: الملف أكبر من 2 ميجا

source: cv can not be empty!
ar: لا يمكن ترك السيرة الذاتية فارغة

source: Your cv file not pdf
ar: ملف السيرة الذاتية ليس pdf

source: Complain has submited and will be intouch with you very soon
ar: تم تسجيل الشكوى وسنتواصل معك لاحقاً

source: profile updated
ar: تم تحديث حسابك

source: Your CV bigger than 2 MB
ar: حجم الملف اكبر من 2 ميجا

source: Your photo bigger than 1 MB
ar: حجم الصورة اكبر من 1 ميجا

source: Your cv file is not pdf
ar: ملف السيرة الذاتية ليس pdf

source: request has submited and will change soon
ar: تم تسجيل الطلب وسيتم التغيير قريبا

source: url has submited
ar: تم تسجيل الرابط

source: Url has updated
ar: تم تحديث الرابط

source: url2 has submited
ar: تم تحديث الرابط

source: new class url has submitted
ar: تم تحميل الرابط

source: new class timing has submitted
ar: تم تحديث المواعيد الجديدة

source: New Date or url can not be empty
ar: التاريخ او الرابط لا يمكن تركه فارغ

source: No teacher profile for the user
ar: لا يوجد حساب للمعلم

source: youtube url not correct get the url from youtube video> share> Embed> src="url"
ar: <Embed> رابط اليوتيوب غير صحيح رجاء انسخ الرابط الصحيح من

source: course created and will show up in courses after review
ar: تم إنشاء الكورس بنجاح وسيظهر في قائمة الكورسات بعد المراجعة

source: course image required
ar: يجب وضع صورة للكورس

source: course updated successfully
ar: تم التعديل بنجاح

source: meeting not open
ar: الحصة ليست مفتوحة

source: New student waiting
ar: طالب جديد في الانتظار

source: review has updated
ar: تم تسجيل التقييم

source: review has submited
ar: تم تسجيل التقييم

source: My orders:
ar: طلباتي

source: Order #
ar: طلب #

source: Course Name
ar: اسم الكورس

source: Order Total
ar: الإجمالي

source: order Date
ar: تاريخ الطلب

source: Status
ar: الحالة

source: Not Orderd
ar: لم يتم الطلب

source: Change Password
ar: تغيير كلمة المرور

source: Current Password
ar: كلمة المرور الحالية

source: Enter your current Password
ar: ادخل كلمة المرور الحالية

source: New password
ar: كلمة المرور الجديدة

source: Enter your new Password
ar: ادخل كلمة المرور الجديدة

source: Confirm New password
ar: تأكيد كلمة المرور

source: Confirm your new Password
ar: تأكيد كلمة المرور

source: save
ar: حفظ

source: Complains
ar: الشكاوي

source: Complain Title(Regards):
ar: عنوان الشكوى او البلاغ

source: Complain:
ar: الشكوى او البلاغ

source: submit
ar: ارسل

source: login as Student:
ar: سجل كطالب

source: Total Courses
ar: اجمالي الكورسات

source: View courses
ar: اعرض الكورسات

source: Choose Course
ar: اختر الكورس

source: Active Courses
ar: الكورسات النشطة

source: Last Unpaid orders
ar: اخر الطلبات غير المدفوعة

source: View orders
ar: اعرض الطلبات

source: user picture
ar: صورة المستخدم

source: Remove Photo
ar: احذف الصورة

source: User profile
ar: تعديل حسابي

source: First Name
ar: الإسم الأول

source: Last Name
ar: الإسم الأخير

source: phone
ar: الهاتف

source: Picture
ar: الصورة

source: Country
ar: الدولة

source: City
ar: المدينة

source: Forgot Password
ar: نسيت كلمة المرور

source: Enter your email Address
ar: ادخل إيميلك

source: Got password? login
ar: تسجيل الدخول

source: Send
ar: ارسل

source: Don\
ar: ليس عندي حساب؟

source: Sign up
ar: تسجيل

source: Mailbox
ar: صندوق البريد

source: INBOX
ar: الوارد

source: SENT
ar: المرسل

source: Unread emails
ar: الرسائل الغير مقرؤه

source: Compose
ar: اكتب رسالة

source: Delete
ar: احذف

source: sent emails
ar: الرسائل المرسلة

source: Thank you for Registration. please activate your account by clicking on activation link in your email
ar: شكراً لتسجيلك معنا من فضلك قم بتفعيل حسابك من خلال الإيميل المرسل لك

source: Already verified?
ar: تم التفعيل؟

source: login
ar: تسجيل دخول

source: Sign in
ar: تسجيل دخول

source: Email Address
ar: الإيميل

source: Password
ar: كلمة المرور

source: Forgot password?
ar: نسيت كلمة المرور؟

source: Login
ar: تسجيل دخول

source: Don't have account?
ar: ليس عندي حساب؟

source: New Email
ar: ايميل جديد

source: Inbox
ar: الوارد

source: Sent
ar: المرسل

source: New Message
ar: رسالة جديدة

source: To:
ar: إلى

source: Subject:
ar: العنوان

source: Message:
ar: رسالة

source: Discard
ar: الغى

source: Finish
ar: انتهى

source: Active
ar: نشط

source: Order
ar: الطلب

source: Transaction ID
ar: رقم التحويل

source: Order Date:
ar: تاريخ الطلب

source: Status:
ar: الحالة

source: Description
ar: الوصف

source: Qty
ar: العدد

source: Product Price
ar: السعر

source: Sub Total:
ar: الإجمالي

source: Tax:
ar: الضريبة

source: Grand Total:
ar: الإجمالي النهائي

source: Thank you for shopping with us!
ar: شكراً لتسوقك معنا

source: Continue Shopping
ar: اذهب للتسوق

source: Mail Service
ar: الإيميلات

source: Sent Mail
ar: ارسل الإيميل

source: course
ar: الكورس

source: Reply
ar: رد

source: Print
ar: اطبع

source: me
ar: أنا

source: to
ar: إلى

source: Email address already exists! Use another one or log in
ar: الإيميل المدخل موجود مسبقاً!!

source: Register
ar: تسجيل

source: Have an account?
ar: أمتلك حساب

source: Log In
ar: تسجيل دخول

source: Are you Teacher?
ar: هل انت معلم؟

source: Register as a teacher
ar: سجل كمعلم

source: Reset password
ar: تغيير كلمة المرور

source: Create password
ar: انشيء كلمة مرور

source: Confirm Password
ar: تأكيد كلمة المرور

source: reset
ar: تغيير

source: Do not have account?
ar: لا أمتلك حساب؟

source: Available in
ar: متاح بـ

source: and
ar: و

source: Choose course language and grade then go!
ar: اختر لغة الكورس والصف ثم ابدء

source: Course
ar: الكورس

source: Teacher
ar: المعلم

source: Highly qualified Teacher
ar: معلمين متميزين ذوي خبرة عالية

source: Teacher C.V.
ar: السيرة الذانية للمعلم

source: Course Fees
ar: رسوم الكورس

source: from
ar: من

source: Course country
ar: دولة المنهج

source: Edit Course
ar: تعديل كورساتي

source: Available Seats
ar: المقاعد المتاحة

source: Review
ar: تقييم الكورس

source: stars
ar: النجوم

source: review
ar: مقيم

source: Advanced
ar: متقدم

source: Buy Now
ar: اشتري الآن

source: users review
ar: مراجعات المستخدمين

source: created at:
ar: إنشيء في

source: last update:
ar: اخر تحديث

source: first
ar: الأول

source: Previous
ar: السابق

source: Next
ar: التالي

source: last
ar: الأخير

source: Courses Search Results
ar: نتائج البحث

source: Item
ar: كورس

source: found
ar: وجد

source: Courses
ar: كورسات

source: All courses prepared by Highly qualified and experienced teachers,
ar: تم إعداد الكورسات من اعلى المعلمين خبرة ومهارة.

source: simply pick your course and excel
ar: كل ما عليك اختيار الكورس وانطلق

source: Search
ar: ابحث

source: Course Image
ar: صورة الكورس

source: FUTURE OF LEARNING,
ar: مستقبل التعليم

source: BOOK YOUR CLASSES NOW
ar: احجز الآن

source: Study online with private highly qualified teacher
ar: ادرس اونلاين مع معلم خبير مخصص لك

source: Get Started
ar: ابدء الآن

source: HOW IT WORKS?.
ar: كيف يعمل؟

source: Simply choose the subject then book number of sessions And Go.
ar: ببساطة اختر المادة وعدد الحصص وانطلق

source: step1:choose subject.
ar: الخطوة الأولى:اختر المادة

source: step2:fill the form.
ar: الخطوة الثانية:قم بتعبئة بياناتك

source: step3:book number of sessions you need and pay.
ar: احجز عدد الحصص

source: you wll get confirmation message by email, your teacher will be in touch with you on your dashboard to choose suitable date and time, your meeting links will be available as well.
ar: بعد إتمام الطلب ستصلك رسالة تأكيد وسيتواصل معك المعلم من خلال صفحة الكورس لتحديد موعد الحصص المناسب بإلاضافة لكل الروابط ستكون متاحة في صفحة الكورس

source: Students
ar: الطلاب

source: Events
ar: الفعاليات

source: Trainers
ar: المدربين

source: Why Choose MySchools?
ar: لماذا تختارنا؟

source: With MYSchools you will experience convent way of learning while you are in your house,
ar: معنا ستدرس بكل سهولة وراحة وانت في مكانك

source: no border limits, we have highly qualified teachers from all around the world,
ar: وسنجلب لك أفضل المعلمين والخبراء من جميع أنحاء العالم.

source: on top of that you can refund your money any time you decide to stop.
ar: مع كل هذا ويمكنك تغيير المعلم او استرداد نقودك والتوقف متى شئت

source: Start Now
ar: ابدء الآن

source: Convent way of learning
ar: طريقة مريحة في التعليم

source: Study while you are in your house in any country with no border limits at all
ar: ادرس وانت في مزلك بدون حدود

source: Easy to Refund and extend
ar: يمكنك استعادة اموالك بكل سهولة اذا قررت التوقف

source: Refund your money easily if you don\
ar: يمكنك استعادة اموالك بكل سهولة اذا قررت التوقف

source: Reasonable prices
ar: أسعار معقولة

source: Enroll on many subjects and enjoy big discounts
ar: سجل الآن واستمتع بالتخفيضات

source: Main Courses
ar: الكورسات الأساسية

source: UAE
ar: الإمارات

source: KSA
ar: السعودية

source: Kuwait
ar: الكويت

source: Qatar
ar: قطر

source: Egypt
ar: مصر

source: Arabic
ar: عربي

source: Math
ar: رياضيات

source: Science
ar: علوم

source: Physics
ar: الفيزياء

source: Chemistry
ar: الكيمياء

source: Quran
ar: قراءن

source: English
ar: الإنجليزي

source: Biology
ar: الأحياء

source: Business Administration
ar: إدارة الأعمال

source: French
ar: اللغة الفرنسية

source: Health Science
ar: العلوم الصحية

source: Music
ar: الموسيقى

source: Integrated curriculum
ar: المنهج المتكامل

source: Emsat
ar: أمسات

source: Visual Arts
ar: الفنون المرئية

source: Popular Courses
ar: الكورسات الرائجة

source: Teacher Dashboard
ar: لوحة التحكم

source: Teacher Courses
ar: كورسات المعلم

source: Teacher Active Courses
ar: كورسات المعلم النشطة

source: Edit Teacher profile
ar: تعديل حسابي

source: complains
ar: الشكاوى والبلاغات

source: Received money
ar: الدفعات المستلمة

source: Ask to withdraw
ar: طلب دفعة

source: Edit user profile
ar: تعديل حسابي

source: Create new course
ar: تصميم كورس جديد

source: Edit my courses
ar: تعديل كورساتي

source: Log out
ar: خروج

source: Dashboard
ar: لوحة التحكم

source: My Courses
ar: كورساتي

source: My Active Courses
ar: كورساتي النشطة

source: Edit profile
ar: تعديل حسابي

source: Unfinished Orders
ar: الطلبات غير المكتملة

source: Chat on Watsapp
ar: تحدث معنا على الواتس

source: Email
ar: الإيميل

source: Useful Links
ar: روابط مفيدة

source: Home
ar: الرئيسية

source: Pricing
ar: الباقات

source: My Mailbox
ar: صندوق البريد

source: Our Services
ar: خدماتنا

source: Private live Teaching
ar: تدريس خاص

source: Face to face private teaching
ar: تدريس خاص بالمنزل

source: language courses
ar: كورسات اللغات

source: Academic researches
ar: البحوث الأكاديمية

source: Doing Homework
ar: المساعدة في عمل الواجبات

source: Student DashBoard
ar: لوحة التحكم

source: DashBoard
ar: لوحة التحكم

source: DashBoards
ar: لوحة التحكم

source: Student
ar: طالب

source: Be a teacher
ar: سجل كمعلم

source: Contact us
ar: تواصل معنا

source: Welcome
ar: أهلا

source: Logout
ar: خروج

source: Are you sure you want to logout?
ar: هل انت متأكد من تسجيل الخروج؟

source: Course Details
ar: بيانات الكورس

source: other
ar: أخرى

source: Enter Your Country
ar: أدخل الدولة

source: Choose Your country
ar: اختر الدولة

source: Grade
ar: الصف

source: Choose Your Grade
ar: اختر الصف

source: Curriculum Type
ar: المنهج

source: Enter Curriculum Type
ar: نوع المنهج

source: Semester
ar: الفصل الدراسي

source: second
ar: الثاني

source: Third
ar: الثالث

source: Course Language
ar: لغة الكورس

source: Chinese
ar: الصينية

source: Choose Course Language
ar: اختر لغة الكورس

source: Notes
ar: ملاحظات

source: Total price with tax
ar: السعر الإجمالي شامل الضريبة

source: Total lessons:
ar: عدد الحصص

source: Quantity
ar: العدد

source: quantity
ar: العدد

source: Try Now
ar: ابدء

source: Go To Courses
ar: اذهب للكورسات

source: Well done
ar: أحسنت

source: Whenever you need to, you can replace the teacher or refund your money
ar: بإمكانك بكل بساطة إستبدال المعلم او إسترجاع أموالك!!

source: Your world is about to look a whole lot better
ar: ستنتقل إلى مستوى مثالي من التعليم!!

source: Payment Successful
ar: تم الدفع بنجاح

source: course Price
ar: سعر الكورس

source: Go to Courses
ar: اذهب للكورسات

source: Course Languge:
ar: لغة الكورس:

source: Course Description:
ar: وصف الكورس

source: Processing
ar: جاري العمل

source: Course Fee
ar: رسوم الكورس

source: Number of Lessons
ar: عدد الحصص

source: left
ar: متبقي

source: Purchase Date
ar: تاريخ الشراء

source: Send message to your Teacher
ar: ارسل رسالة للمعلم

source: join live class
ar: ادخل الحصة

source: Course has delivered successfully
ar: تم الإنتهاء من الكورس بنجاح

source: some thing wrong?
ar: شيء ما خطأ؟

source: Class not open
ar: الحصة ليست مفتوحة

source: Refresh the page
ar: رجاء إعادة تحميل الصفحة

source: Meetings url and Timing
ar: وقت الحصة ورابط الحصة على التيمز او الزوم

source: Course Material url
ar: رابط مذكرات الكورس على الدرايف الخاص بالمعلم

source: Rate the Course
ar: قيم الكورس

source: Ask to change the teacher or refund
ar: اطلب تغيير المعلم او الغاء الكورس

source: Teacher will add the Urls for you to Join soon
ar: سيقوم المعلم بإضافة رابط الحصة قريباً

source: Teacher will add url soon!
ar: سيقوم المعلم بإضافة الرابط قريبا

source: Course Material URl
ar: رابط المواد العلمية للكورس

source: Course :
ar: الكورس

source: Curriculum type:
ar: نوع المنهج

source: Grade:
ar: الصف

source: Term:
ar: الفصل الدراسي

source: Language:
ar: اللغة

source: Country:
ar: الدولة

source: Notes:
ar: ملاحظات

source: Update your review
ar: تحديث التقييم

source: Write your review
ar: اكتب تقييمك

source: Rating
ar: التقييم

source: hover on the stars(Required)
ar: اشر بالماوس على النجوم

source: Review Title:
ar: عنوان المراجعة

source: Review:
ar: التقييم

source: Request:
ar: نوع الطلب

source: Other
ar: أخرى

source: Change teacher
ar: تغيير المعلم

source: Refund
ar: ارجاع المبلغ والغاء الكوس

source: Reason:
ar: السبب

source: Course Finished
ar: الكورس انتهى

source: Review order Details
ar: قيم الكورس

source: Billing Address
ar: عنوان الفوترة

source: Order Note
ar: ملاحظات

source: Payment method
ar: طريقة الدفع

source: My Course
ar: بيانات الكورس

source: lessons
ar: الحصص

source: Price
ar: الثمن

source: Back to Courses
ar: الرجوع للكورسات

source: Course price:
ar: ثمن الكورس

source: Quantity:
ar: العدد

source: Tax
ar: الضريبة

source: Total
ar: الإجمالي

source: Pick the bundle and start
ar: اختر الباقة وابدء الآن

source: Three Classes
ar: ثلاث حصص

source: classes
ar: حصص

source: More than Three hours
ar: اكثر من ثلاث ساعات

source: Course material
ar: مذكرات من المعلم

source: Special follow up
ar: متابعة خاصة

source: Discount on extend
ar: تخفيض حال زيادة عدد الحصص

source: Classes
ar: حصص

source: More than six hours
ar: اكثر من ست ساعات

source: Trainer/Teacher
ar: المدرس

source: will assigned soon
ar: سيتم تعيين المدرس قريباً

source: Course Fee(for teacher)
ar: مستحقات الكورس للمعلم

source: Trial Class
ar: حصة تجريبية

source: Send mail to your student
ar: ارسل رسالة لطلابك

source: Start live class
ar: ابدء الحصة

source: Enter Lessons urls or change course state to done
ar: ادخل رابط الحصة او غير حالة الحصة لتم

source: Change class Time or url
ar: تغيير توقيت الحصة او الرابط

source: Enter Material url
ar: ادخل رابط الكورس على التيمز او الزوم

source: Reject the course
ar: ارفض الكورس

source: Go to Dashboard
ar: الذهاب للوحة التحكم

source: Lessons Urls From Teacher
ar: رابط الحصة من المعلم

source: lesson url (lesson done)
ar: رابط الحصة

source: Class Time:
ar: وقت الحصة

source: lesson url
ar: رابط الحصة

source: please add lesson url on zoom!
ar: من فضلك ضع رابط الحصة على الزوم او التيمز

source: Enter Course URls
ar: ادخل رابط الحصة على الزوم او التيمز

source: Please add course urls on zoom or teams!
ar: ادخل رابط الحصة على الزوم او التيمز

source: Enter Course Material URl
ar: ادخل رابط المذكرات على الدرايف الخاص بالمعلم

source: please add course material url on drive!
ar: ادخل رابط المذكرات على الدرايف الخاص بالمعلم

source: Country
ar: الدولة

source: Enter Lessons urls
ar: ادخل رابط الحصة على الزوم او التيمز

source: Update Lessons state(finish or not)
ar: تحديث حالة الحصة

source: course url:
ar: رابط الحصة على الزوم او التيمز

source: class time:
ar: وقت الحصة

source: is lesson done?
ar: هل الحصة انتهت؟

source: course Date:
ar: تاريخ الكورس

source: lesson of
ar: الحصة

source: lesson Done?
ar: هل الحصة انتهت؟

source: All lessons delivered
ar: كل الحصص انتهت

source: Enter Course Material url
ar: ادخل رابط المذكرات على الدرايف الخاص بالمعلم

source: Course Material url:
ar: رابط المذكرات على الدرايف الخاص بالمعلم

source: Reject the Course
ar: ارفض الكورس

source: Reason
ar: السبب

source: Change date and time
ar: تغيير تاريخ الحصة أو ميعادها

source: Change class time or url
ar: تغيير وقت الحصة او الرابط

source: Course:
ar: الكورس

source: New date(in case you want to change lesson Timing):
ar: التاريخ الجديد في حال اردت تغيير التاريخ والموعد

source: New url(in case you want to change lesson url):
ar: الرابط الجديد في حال اردت تغيير الرابط

source: My Courses:
ar: كورساتي

source: Course id #
ar: رقم الكورس

source: Course English Name
ar: اسم الكورس بالانجليزي

source: Course Arabic Name
ar: اسم الكورس بالعربي

source: Published
ar: نُشر

source: Total classes
ar: عدد الحصص

source: Teacher Complains
ar: شكاوي المعلمين

source: Teacher profile
ar: حساب المعلم

source: qualifications
ar: المؤهلات

source: course you teach
ar: المادة التي تدرسها

source: grades you teach
ar: الصفوف التى تدرسها

source: CV
ar: السيرة الذاتية

source: Experience Summery
ar: ملخص الخبرة

source: Create my course
ar: تصميم الكورس

source: course picture
ar: صورة الكورس

source: is the Course school subject?
ar: هل الكورس مادة مدرسية؟

source: English Course Name
ar: اسم الكورس بالإنجليزي

source: pick a unique course Name
ar: !!رجاء إختيار إسم مميز للكورس

source: Course Name already exists! Use another one!!
ar: اسم الكورس مستخدم سابقا!!

source: Arabic Course Name
ar: اسم الكورس بالعربي

source: Course first language
ar: لغة الكورس الأولى

source: Course second language
ar: لغة الكورس الثانية

source: Course image
ar: صورة الكورس

source: Youtube link
ar: رابط اليوتيوب

source: if you have course presentation video on youtube
ar: رابط تعريفي للكورس او للمعلم على اليوتيوب(إختياري)

source: Get the Url from youtube video> share> Embed> src="url"
ar: احصل على الرابط الصحيح من اليوتيوب الفيديو share ثم Embed

source: Curriculum type in English
ar: نوع المنهج بالإنجليزي

source: Hold
ar: اضغط

source: to choose more than one
ar: لاختيار أكثر من منهج

source: Curriculum type in Arabic
ar: نوع المنهج بالعربي

source: Course grades
ar: الصفوف المعنية بالكورس

source: to choose more than grade
ar: لاختيار أكثر من صف

source: Course description in English
ar: وصف الكورس بالانجليزي

source: Course description in Arabic
ar: وصف الكورس بالعربي

source: Received Installments:
ar: الدفعات المستلمة

source: Transfer#
ar: تحويل

source: Transfer Date
ar: تاريخ التحويل

source: Total Received:
ar: المبلغ المستلم

source: Thank you for Registration to be one of us. But Unfortunately your qualifications doesn
ar: شكرا لتسجيلك معنا لكن للأسف لم يجتز ملفك متطلباتنا

source: Want to complain?
ar: ارغب بالشكوى؟

source: Teacher Registration Form
ar: نموذج تسجيل المعلم

source: Country you teach in (Required)
ar: الدولة التى تدرس فيها(مطلوب)

source: City you teach in (optional)
ar: المدينة التى تدرس فيها(إختياري)

source: eg. BSC in Education Arabic dep.(Required)
ar: مثال بكالوريس التربية قسم لغة عربية(مطلوب)

source: 2nd Academic Degree(optional)
ar: درجة علمية إضافية-(إختياري)

source: 3rd Academic Degree(optional)
ar: درجة علمية إضافية-(إختياري)

source: 4th Academic Degree(optional)
ar: درجة علمية إضافية-(إختياري)

source: subject you teach.(Required)
ar: المادة التي تدرسها(مطلوب)

source: to transfer your money.(you can fill later)
ar: لتحويل مستحقاتك(يمكن تعبئته لاحقاً)

source: upload CV.(Required-pdf only less than 2MB)
ar: تحميل السيرة الذاتية pdf (الحجم لا يزيد عن 2 ميجا)

source: Recap your Experience.
ar: ملخص السيرة الذاتية

source: Any thing you want to say about yourself (optional)
ar: اي ملاحظات تود أن تخبرنا بها

source: login as Teacher:
ar: المعلم:

source: NO Courses Yet
ar: لا توجد كورسات لك حاليا

source: Total Balance
ar: الإجمالي

source: Previous installments
ar: الدفعات السابقة

source: NO Balance Yet
ar: لا يوجد رصيد

source: Withdrawable balance
ar: اسحب الرصيد

source: Min. limit to withdraw 50 $
ar: اقل مبلغ للسحب $50

source: Ranking system in 3 months period
ar: نظام التقييم في اخر ثلاثة أشهر

source: Thank you for Registration to be one of us. please wait until your account be Reviewed.
ar: شكراً لتسجيلك معنا رجاء الإنتظار حتى يتم مراجعة حسابك

source: Go to Home?
ar: الذهاب للصفحة الرئيسية

source: Money Withdrawn Request
ar: طلب سحب الرصيد

source: Withdraw Request
ar: طلب سحب الرصيد

source: how much money to withdraw?
ar: المبلغ المطلوب سحبه؟

source: Your available balance to receive
ar: المبلغ المتاح للسحب

source: Minimum limit for withdraw 50 $
ar: اقل مبلغ للسحب $50

source: Thank you for registration with us,YOUR ACCOUNT HAS BEEN CREATED! ,Please, verify it by clicking the activation link that has been sent to your email.If the email doesn't appear shortly, please be sure to check your spam
ar: نشكرك لتسجيلك معنا، من فضلك اضغط الرابط المرسل على الايميل لتفعيل حسابك.إذا لم تجد الرابط لطفاً ابحث في الإيميلات المهملة

source: successfully login
ar: تم تسجيل الدخول بنجاح

source: Wrong email or password or account not activated
ar: ايميل او كلمة المرور خطأ او الحساب لم يتم تفعيله

source: successfully Logout
ar: تم تسجيل الخروج بنجاح

source: successfully activated
ar: تم تفعيل الحساب بنجاح

source: invaild link
ar: رابط غير صالح

source: Click on the link on reset password mail sent to you
ar: اضغط على الرابط في الايميل المرسل لك

source: account does not exist
ar: لا يوجد حساب

source: Reset your Password
ar: تغيير كلمة المرور

source: Reset password link expired
ar: صلاحية الرابط انتهت

source: new password has set
ar: تم تغيير كلمة المرور

source: confirm Password does not match
ar: كلمة المرور والتأكيد لا يتطابقان

source: password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: invalid current password
ar: كلمة المرور غير صالحة

source: new password and confirmed password do not match
ar: كلمة المرور والتأكيد لا يتطابقان

source: Your can not sent to your self!
ar: لا يمكن ارسال رسال لنفسك

source: Your message was successfully sent!
ar: تم ارسال رسالتك بنجاح
